package com.system.import_data;

import java.util.HashMap;
import java.util.Map;

public class DynastyUtil {
	
	public static Map<String,String> dynastyMap = new HashMap<String,String>(){{
		put("新石器时代","新石器时代（距今1万年-距今5000至2000年不等）");
		put("夏","夏（前 2070-前 1600 年）");
		put("商","商（前 1600 年-前 1046 年）");
		put("周","周（前1046-前256年）");
		put("秦","秦（前9世纪-前206年）");
		put("汉","汉（前202-8，25-220年）");
		put("三国","三国（220-280年）");
		put("晋","晋（265-420年）");
		put("十六国","十六国");
		put("南北朝","南北朝（420-589年）");
		put("隋","隋（581-618 年）");
		put("唐","唐（618-907 年）			 ");
		put("五代","五代十国（907-979年）");
		put("宋","宋（960-1279年）");
		put("辽","辽（916-1125 年）");
		put("西夏","西夏（1038-1227 年）");
		put("金","金（1115-1234 年）");
		put("元","元（1271-1368 年）			");
		put("明","明（1368-1644 年）");
		put("清","清（1644-1911 年）");
	}};
	
}
